Repository: Kaymit/SecuryptMVC
Catalog: Resources/MyStrings.*.resx
Languages: no

# DecryptH2
source: Decrypt
no: Dekryptering

# DecryptHome_btn
source: Start Decrypting!
no: Start dekryptering

# Decrypt_desc
source: An authorized party, however, is able to decode the ciphertext using a decryption algorithm, that usually requires a secret decryption key, that adversaries do not have access to. For technical reasons, an encryption scheme usually needs a key-generation algorithm, to randomly produce keys.
no: Et autorisert selskap er i stand til å dekode den krypterte teksten ved bruk av en dekrypteringsalgoritme. Dette krever vanligvis en hemmelig dekrypteringsnøkkel som motstandere ikke har tilgang til. Av tekniske årsaker trenger vanligvis et krypteringsskjema en nøkkelgenerert algoritme til å produsere tilfeldige nøkler.

# DragArea
source: Drag and drop your files here
no: Dra og slipp filene dine her

# DragDropH2
source: Drag & Drop file upload
no: Dra og slipp filene filopplasting

# EncryptH2
source: Encrypt
no: Kryptering

# EncryptHome_btn
source: Start Encrypting!
no: Start kryptering

# EncryptUpload_btn
source: Encrypt
no: Kryptering

# Encrypt_desc
source: In cryptography, encryption is the process of encoding a message or information in such a way that only authorized parties can access it. Encryption does not itself prevent interference, but denies the intelligible content to a would-be interceptor. In an encryption scheme, the intended information or message, referred to as plaintext, is encrypted using an encryption algorithm – a cipher – generating ciphertext that can only be read if decrypted.
no: I kryptografi er kryptering kodingsprosessen av en beskjed eller informasjon på en slik måte at kun autoriserte selskap har adgang til det. Kryptering hindrer ikke forstyrrelser i seg selv, men nekter det forståelige innholdet til en potensiell inntrenger. I et krypteringsskjema er den tiltenkte informasjonen eller meldingen, referert som ren tekst, kryptert ved bruk av en krypteringsalgoritme som generer kryptert tekst som kun kan leses ved dekryptering

# HowStartH2
source: How to start
no: Hvordan sette i gang

# Jumbotron
source: Securypt allows you to encrypt and decrypt your files. Files may be saved locally or stored on a server. Create an account for a public key
no: lar deg kryptere og dekryptere filene dine. Filer kan lagres lokalt eller på en server. Opprett en konto for offentlig nøkkel.

# Jumbo_btn
source: Get started
no: Sett i gang

# Tutorial_pt1
source: To get started, register for an account to generate your public key. Keep this saved somewhere where you won't lose it.
no: Start med å opprette en konto og generer en offentlig nøkkel. Ha denne lagret en plass du ikke vil miste den.

# About_link
source: About
no: Omkring

# Contact_link
source: Contact
no: Kontakt

# Download_link
source: Download
no: Nedlasting

# Home_link
source: Home
no: Start

# Upload_link
source: Upload
no: Laste opp

source: Log in
no: Logg Inn

source: Register
no: Registrere

# About_p1
source: In the download page, you can view, edit, and manage your files.
no: På nedlastningssiden kan du vise, redigere og styre filene dine

# About_p2
source: Currently, all your uploaded files are private, meaning only you can view them. If you wish to change this select the "Edit" button and uncheck the private box.
no: I utgangspunktet er alle de opplastede filene dine privat, det vil si at det er kun du som se dem. Dersom du ønsker å endre på dette klikker du på "rediger"-knappen og tar bort haken for privat

# Contact
source: Why would you want to contact us?
no: Ta kontakt med administratoren for eventuelle spørsmål eller bekymringer.

# ForgotViewModel_displayEmail
source: Email
no: E-post

# Items_create
source: Create
no: Opprett

# Items_delete
source: Delete
no: Slett

# Items_details
source: Details
no: Detaljer

# Items_edit
source: Edit
no: Rediger

# Items_name
source: Name
no: Navn

# Items_publicKey
source: Public Key
no: Offentlig nøkkel

# Items_storageLoc
source: Storage Location
no: Lagringslokasjon

# ManageH4
source: Change your account settings
no: Endre kontoinnstillinger

# Manage_changePassActLink
source: Change your password
no: Endre passord

# Manage_createActLink
source: Create
no: Opprett

# Manage_manageActLink
source: Manage
no: Få til

# Manage_publicKey
source: Public Key
no: Offentlig nøkkel

# Shared_greeting
source: Hello
no: Hei

# Tutorial_pt2
source: Click on the 'Upload' tab to start. Drag and drop or upload files from your computer onto the upload area. Once all your files have been selected, click "Encrypt" to encrypt your files. After, your encrypted files will be stored locally on your computer or you can choose to store them on a server.
no: Klikk på "opplasting"-knappen for å starte. Dra og slipp eller last opp filer fra pc'en din til opplatingsfeltet. Når alle filene dine er valgt trykker du "krypter" for å kryptere filene dine. Deretter kan du lagre de krypterte filene dine lokalt på din PC eller du kan lagre dem på en server.

# Tutorial_pt3
source: Decrypting your files is just as easy. Drag and drop or upload your encrypted files for decryption.
no: Vår krypteringsserver vil dekryptere filene dine og vise dem til deg over den utbredte HTTPS-protokollen, slik at dataene dine blir sikre.

# UploadedFilesH2
source: Uploaded Files
no: Last opp filer

# Upload_alt
source: Or upload your files here
no: Eller last opp filene dine her

# Upload_success
source: file(s) uploaded successfully
no: Opplasting av fil(er) vellykket

# Wikipedia
source: From Wikipedia, the free encyclopedia
no: Fra Wikipedia; gratis leksikon
